:PROPERTIES:
:ID: D4A4CA18-7652-4B2E-A51D-F8CD3C40777F
:END:
#+title: Check if Account Has Permission
#+description: Check if Account Has Permission
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:sql:rbac_roles_and_permissions:
#+created: 2026-05-21
#+updated: 2026-05-21

Uses the built-in RBAC function:

#+begin_src sql
select ores.account_has_permission('admin', 'accounts:create') as has_permission;
#+end_src

#+RESULTS:
#+begin_example
|---|
#+end_example
